Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/P09.tmx
Source language: en_us
Languages: zh_cn

source: Least Resistance
zh_cn: 轻松

source: NICK CAMPBELL BUILT small-block engines with more bottom end than anyone in Waterbury- some said in all New England.
zh_cn: 尼克·坎贝尔改装美制八缸发动机的本事，在沃特伯里没人能比得上。有些人还说，就是在整个新英格兰地区，他也是头一份。

source: His shop was Out of the Hole Automotive, the name sewn in midnight blue over the pockets of our work shirts.
zh_cn: 他的汽车修理店叫做“领先汽修”。在我们工作服衬衫的口袋上，就用深蓝色的线绣上了这个名字。

source: At 33, Nick was a legend, and as I pulled on my uniform each morning I felt transformed from pathetic teenager to minor superhero.
zh_cn: 33岁的尼克已经是一位传奇人物。而每天早晨当我套上工作服之后，也会感到自己好像从一个十几岁的平庸少年，摇身一变成了个小英雄。

source: So when Nick's jobs started coming back as rechecks, I was fairly devastated.
zh_cn: 正因为如此，当尼克改装的车开始出现返修现象时，我觉得相当震惊。

source: The first was a '70 Monte Carlo, whose 350 engine Nick had beefed up with a high-lift roller cam and racing pistons.
zh_cn: 最开始是一辆七十年代的蒙特卡洛轿车。尼克用高扬程滚子凸轮和赛车级活塞把它的350发动机做了改装。

source: Mimo, the owner, was a high-maintenance price-haggler, and I wasn't surprised when he pulled right into the bays without a ticket.
zh_cn: 那车的车主叫米姆，是个经常来修车，并且喜欢讨价还价的人。当他没有预约就开车进了修理区时，我并不感到惊讶。

source: "I'm not happy about this, boys," he said, lisping like he did when he was excited.
zh_cn: “伙计们，我对这次的活儿很不满意。”他口齿不清地说着，他一激动就这样。

source: Mimo was a fat man, always in a turtleneck and paperboy cap.
zh_cn: 米姆是一个胖子，总是穿着套头衫，戴顶鸭舌帽。

source: One of his relatives was supposedly connected, but Mimo looked less like a dangerous mobster than like Dom DeLuise.
zh_cn: 据说他有个亲戚很有背景，但他本人看起来可一点都不像多姆·德卢西【衣着得体的喜剧演员，胖子。——译者注】，倒更象是个危险的黑帮分子。

source: Nick, Tommy Costello, and I were all on cars at the time, and approached the Monte from different angles.
zh_cn: 当时，尼克、汤米·科斯特洛和我三个人都在修车。我们从不同的位置向他那辆车走过来。

source: Nick stopped to light a cigarette with a lack of urgency that I tried to imitate.
zh_cn: 尼克走到半道停下来，不急不忙地点了根烟。我一直都想学他这种派头。

source: "What's the trouble, Mimo?" he said.
zh_cn: “怎么了，米姆？”他问。

source: "Oil's the trouble.
zh_cn: “机油出了问题。

source: Drips all over my garage floor."
zh_cn: 我的车库地板上滴得到处都是。”

source: He reeked of sweet cologne.
zh_cn: 他身上洒了太多的古龙水。

source: You couldn't get it off all day, if he shook your hand.
zh_cn: 如果他跟你握个手，你一整天都去不掉那种味。

source: Instead of putting the Monte up on the lift, Tommy ("Tommy the Temper," as some of our regulars called him) kicked over a creeper and rolled under the car with a droplight.
zh_cn: 汤米——我们的一些常客叫他“急脾气汤米”——没有把蒙特卡洛用升降机抬起来，而是直接用脚踢过来一个修车躺板，然后拿着挂灯钻进了车底下。

source: At this point we could still hope that Nick's work wasn't to blame.
zh_cn: 直到这时我们仍然希望，不是尼克的活儿出了问题。

source: Maybe the leak was condensation from the air conditioner, and Mimo couldn't tell oil from water.
zh_cn: 也许滴下来的只是汽车空调的冷凝水。而米姆根本分不清油和水。

source: We still had options.
zh_cn: 我们仍然有回旋余地。

source: But when Tommy rolled back out and, flat on his back, just stared at the blackened ceiling, my stomach dropped.
zh_cn: 但是，当看到汤米平躺在板子上滑出来后，眼睛直直地盯着变黑了的天花板时，我的心一下子沉了下来。

source: He sat forward, one of his eyebrows raised in a look that was as close as he came to compassion.
zh_cn: 他向前坐起来，扬起一边的眉毛。这是他能做出来的最接近于同情的表情。

source: He said to Nick, "It's the drain plug."
zh_cn: 他对尼克说：“是放油塞的事。”

source: "Don't tell me he cross-threaded it," Mimo said, lisping wildly.
zh_cn: “别跟我说他把它拧得脱了扣，”米姆又口齿不清地说起来。

source: Tommy swung around with a mean smirk, and I could guess what was next.
zh_cn: 汤米向他转过身，脸上带着一丝坏笑，我都能猜得出接下来会是什么样。

source: "He what-ed it?"
zh_cn: “他把它怎么了？”

source: Tommy said.
zh_cn: 汤米问。

source: "Cross-threaded."
zh_cn: “拧脱了扣。”

source: "Croth-threaded?"
zh_cn: “你脱了裤？” 【汤米在讥讽米姆的口齿不清——译者注】

source: But Mimo hadn't seen it coming.
zh_cn: 但米姆一点都没明白是怎么回事。

source: He leaned on his car, a flush rising through his jowls as he folded his arms.
zh_cn: 他靠在他的车上，抱起了胳膊，脸开始涨红。

source: "What is your problem, man?"
zh_cn: “你怎么了，伙计？”

source: Tommy leaned over the dynamometer and spat in the wheel well.
zh_cn: 汤米靠在测功机上，朝着车轮吐了口痰。

source: "My problem," he said, "is a guy pulls in here like he owns the fucking place.
zh_cn: “没怎么着，”他说，“就是有个人把车开进来，好像他是这个他妈地方的老板。

source: A guy that drops off his car every other month for more cam, more carb, more exhaust, thinking it's gonna make his dick bigger, and then don't want to pay."
zh_cn: 就是有个人隔俩月就把车送过来，要装上更大的凸轮，更大的化油器，更大的排气量，以为这能让他的老二也变大，但最后却不想掏钱。”

source: "Jesus, Tommy," I said, feeling I had to say something, out of common decency.
zh_cn: “上帝啊，汤米。”我说道。仅仅出于礼貌，我也觉得不得不说点什么。

source: "What's wrong with the drain plug?" Nick said.
zh_cn: “放油塞怎么了？”尼克问。

source: Tommy rubbed his oil-wet fingertips.
zh_cn: 汤米搓着他油湿的手指。

source: "It's loose a little bit."
zh_cn: “稍微松了一点。”

source: "Loose?" Nick said.
zh_cn: “松了？”尼克说。

source: The word took the wind out of him.
zh_cn: 这个词让他的自信很受打击。

source: Quick as I'd ever seen him do anything, Tommy dug a five-eighths box-end out of a drawer and went back under the car.
zh_cn: 汤米以我从没见过的速度从抽屉里翻出一个5/8英寸的方头油塞，重新钻进了车下面。

source: Nick, our boss, our leader, neglecting something so basic- imagine going a day unaware you forgot to put on your right shoe- was inconceivable.
zh_cn: 尼克是我们的老板，我们的领袖。他会犯一个这么低级的错误，简直不可思议。这就像出门一整天，却一直没有意识到你光着右脚一样。

source: Nick smoked and stared at the car dumbfounded, dazed.
zh_cn: 尼克抽着烟，盯着汽车目瞪口呆，一脸茫然。

source: Mary Ann, his wife, passed by with her bookkeeping binder.
zh_cn: 他的妻子玛丽安捧着出纳簿从边上走过。

source: The three of us, standing quiet as mourners around Mimo's car, stopped her short of the lobby door.
zh_cn: 看到我们三个站在米姆的汽车周围，安静得象在送葬一样，她在营业室门口停了下来。

source: "What's wrong?" she said.
zh_cn: “出了什么事？”她问。

source: Nick wouldn't look at her, and when she turned to me, I was torn between the loyalty I owed the two people who mattered to me most.
zh_cn: 尼克没理她。当她转过来问我时，我在到底该忠于她还是忠于尼克的问题上，不知该如何取舍。他俩对我都是最要紧的人。

source: I couldn't blow her off, and I couldn't tell on Nick.
zh_cn: 我不能不理她，但我也不能说尼克的坏话。

source: Thank God Nick spoke up then, just as Mary Ann started to walk away.
zh_cn: 谢天谢地，当玛丽安已经开始要走时，尼克开口了。

source: "Do me a favor," he said.
zh_cn: “帮我个忙，”他说。

source: "Take Mimo out to the lobby and give him his money back."
zh_cn: “带米姆去营业室，把他的钱退给他。”

source: "Whoa," Mimo said, a flattered, guilt-ridden knot of emotion now.
zh_cn: “哇，”米姆说道。现在他的表情变成了受宠若惊，满心内疚的样子。

source: "That's $1,800.
zh_cn: “那一共是1800美元呐。

source: I'd be happy with a discount."
zh_cn: 其实能打个折我就很高兴了。”

source: "I don't give a damn what you're happy with," Nick said, and he threw his cigarette in the trash can, where any number of things could have gone up in flames.
zh_cn: “我才不在乎你高兴不高兴，”尼克说道。他把烟头扔进垃圾桶里。那里面可都是些易燃物啊。

source: WHAT HAPPENED BETWEEN Mary Ann and me started as conversations in the parts room.
zh_cn: 玛丽安和我之间的事情，是从在零件室里的交谈开始的。

source: She'd ask me about my girlfriend, Katie, what we did on our dates, whether I said nice things to her.
zh_cn: 她问起我的女朋友凯蒂，问我们约会时都做些什么，以及我是否对她说过好听的。

source: When Katie broke up with me a week before Christmas, I couldn't bring myself to tell Mary Ann.
zh_cn: 在离圣诞节还有一个星期时，凯蒂把我甩了。但我没法告诉玛丽安。

source: I was embarrassed and hurt, two things I didn't want to show, but inevitably those feelings came out, and Mary Ann and I had our first hug between thermostats and Fram oil filters.
zh_cn: 我觉得很尴尬，也很痛苦。尽管我不想流露出这两种感受，但最终还是漏了馅儿。就在调温器和机油滤芯之间，玛丽安和我第一次彼此拥抱。

source: It was a big hug, which gave me a glimpse into where our friendship might lead.
zh_cn: 那是一个久久的拥抱，让我对我们的友谊今后会朝哪个方向发展，朦胧地有了一点感觉。

source: Why I betrayed the one man I wanted to become wasn't clear to me then- the summer I turned 19- and only with the distance of time do I see the kid who thought he was exempt from the basic laws of civilized life.
zh_cn: 在进入十九岁的那个夏天，我并不清楚自己为什么会背叛了我最想成为的那个人。只有随着时间的推移，我才理解了当时自以为被文明生活的基本法则排除在外的我。

source: Sometimes, as Nick and I buttoned up a car he'd just brought back from the dead, I'd promise myself Mary Ann and I were over.
zh_cn: 有时，当我和尼克收拾完一辆刚刚被他妙手回春的汽车之后，我会向自己发誓要结束我和玛丽安之间的关系。

source: But then she'd come out through the bays, not even noticing me as she started an inventory, completely focused on her job, so strong to do that when only days earlier an orgasm I'd given her had made her cry.
zh_cn: 可随后，当她出来穿过修理区，去登记新的库存零件时，却对我视而不见，全神贯注地专心工作。她的意志显得如此坚强，然而我知道，就在几天前，我带给她的高潮还曾让她哭出来。

source: If right then she told me to declare my love for her to Nick, I would have.
zh_cn: 此刻，即使她让我对尼克公开说出我对她的爱，我也能干得出来。

source: I would have done almost anything.
zh_cn: 为了她我会去干任何事情。

source: "Chant with me," she said, late one morning in her living room.
zh_cn: 有天早上快到中午了，在她家客厅里，她说：“跟我一起诵经吧。”

source: I didn't worry much about Nick coming home on our Tuesdays together.
zh_cn: 每星期二我们幽会时，我不太担心尼克会突然回家。

source: Nick was a raging workaholic, and besides, he'd never leave Tommy alone at the shop to greet customers.
zh_cn: 他是一个彻底的工作狂，而且从来不会把汤米一个人留在店里招呼客人。

source: Sometimes Mary Ann and I left our clothes off after making love- likely as not we'd fall back into the act after a while- and as she crossed the room to the stereo, I watched her back and ass and thighs.
zh_cn: 有时玛丽安和我做爱之后，仍然继续光着身子——过上一会没准我们会再做一次——当她穿过房间向音响走过去的时候，我的目光追随着她的腰肢、屁股还有大腿。

source: Her body didn't disappoint me when she undressed, unlike the two girlfriends I'd been with, both of whom were 13 years younger than Mary Ann.
zh_cn: 她脱掉衣服后的身体并没有令我失望。我的前两个女朋友却都没能做到这一点，尽管她们两人都比玛丽安要年轻十三岁。

source: The big plaster-walled living room held six framed photographs.
zh_cn: 客厅的板墙上挂着六个相框。

source: Over the fireplace mantel Nick was standing arm in arm with Buddy Baker after Buddy had broken 200 miles per hour at Talladega.
zh_cn: 在壁炉上方的那张照片里，尼克与巴迪·贝克尔手挽手站在一起。那是巴迪在塔拉迪加驾车突破每小时200英里的时速后，他们照的合影。

source: The other pictures were of Oregon, where Nick and Mary Ann had moved from four years ago.
zh_cn: 其他照片是尼克和玛丽安在俄勒冈州照的，他们四年前才从那里搬过来。

source: Rolling waves were framed by miles of Sahara-like dunes.
zh_cn: 有的照片是滚动的海浪被撒哈拉沙漠般绵延数里的沙丘拦住。

source: A lake inside a dead volcano, white mountain peaks, lava fields that looked like the face of the moon.
zh_cn: 还有的是死火山山顶的湖泊，白色的山峰映着象月球表面一样的熔岩地貌。

source: Nick and Mary Ann came out East when Nick inherited the shop from an uncle who had died of emphysema.
zh_cn: 尼克和玛丽安当初之所以搬到东部来，是因为尼克从他那位死于肺气肿的叔叔那里继承了这家店。

source: I imagined that arriving here, in run-down Waterbury, from such a place as Oregon, must've been like waking from a dream.
zh_cn: 我想象他们从俄勒冈州那样的地方刚来到破败的沃特伯里时，一定感觉像从美梦中醒来。

source: Mary Ann put in a cassette, and the sound that rose from the speakers was unlike any I'd ever heard.
zh_cn: 玛丽安把磁带放进去，随后从扬声器中响起的声音，是我过去从来没有听到过的动静。

source: Two rich voices that could only belong to gorgeous dark-eyed Indian women sang the first chorus.
zh_cn: 两个丰富多彩的女声唱出第一段组合。这样的声音想必只会属于眼睛漆黑的印度美女。

source: Om namah shivaya.
zh_cn: 唵嗱玛释哇吖。

source: Then a hundred or a thousand voices in unison.
zh_cn: 接着有成百上千的声音整齐地响起。

source: Behind the chant were the slightest sounds, tiny wind chimes, tiny buzzing.
zh_cn: 在唱诵的声音后面，还有些难以察觉的细微声音，象小的风铃声，小的嗡嗡声。

source: Then om namah shivaya.
zh_cn: 唵嗱玛释哇吖。

source: OM NAMAH SHIVAYA.
zh_cn: “唵嗱玛释哇吖”。

source: You could hear tears in the women's voices, anguish, then resolve, safety.
zh_cn: 你可以从女人的声音中听出泪水，从痛苦，到决绝，到平安。

source: "What are they saying?"
zh_cn: “她们说的是什么？”

source: "It's a salutation to that which we are capable of becoming."
zh_cn: “是向我们能达到的那种境界而膜拜。”

source: Mary Ann took my hand and brought me to the carpet, piled my legs in rough approximation of a lotus, and positioned herself beside me.
zh_cn: 玛丽安拉着我的手，带我走到地毯上，把我的腿盘成类似打坐的样子，然后她自己也在我旁边坐了下来。

source: I started to sway.
zh_cn: 我开始摇晃起来。

source: It was warm, and we were naked with this remarkable sound.
zh_cn: 屋里很温暖，而我们则赤裸着与这奇妙的声音相伴。

source: And then the phone rang.
zh_cn: 此时电话响了。

source: She let the machine answer, and the sound of Nick's voice in the house shot through me like a spark-plug jolt.
zh_cn: 她听任电话转到自动应答机上，尼克的说话声穿过房间，好象火花塞放出的电，把我给电了一下。

source: "Babe, I can't find the last Carquest order ..."
zh_cn: “宝贝，我找不到上次从卡魁斯特定的货了...”

source: When the message was over, she turned off the chant tape, and we dressed in the silence of Adam and Eve after the apple.
zh_cn: 留言结束之后，她关掉了诵经录音，我们就好像是吃过了苹果的亚当和夏娃，在沉默中穿起衣服。

source: Though she herself didn't drink, Mary Ann went to the kitchen and brought me one of Nick's Heinekens.
zh_cn: 尽管玛丽安自己并不喝酒，但她去厨房给我拿来了一罐尼克的喜力啤酒。

source: It wasn't quite noon, but the day already had the feel of an epic journey for us, and all comforts were allowed.
zh_cn: 天还不到中午，但已经让我们有了一种长途跋涉之后的感觉，可以尽量犒劳自己一下了。

source: "Do you believe in karma?" I said.
zh_cn: “你相信恶报吗？”我问。

source: She watched me a moment, as if to see where this was going, then nodded.
zh_cn: 她端详了我一会儿，仿佛要琢磨我问这话的意思，然后点点头。

source: "What's a good way to improve it?"
zh_cn: “有什么好的办法可以免遭恶报吗？”

source: "Go to college.
zh_cn: “去上大学。

source: Do something with your life."
zh_cn: 别浪费自己的生命。”

source: I lit one of her menthols, a taste I'd already come to associate with these air-conditioned, self-indulgent mornings.
zh_cn: 我点了一支她的薄荷烟。我已经习惯于把它的味道与空调房里自我放纵的早晨联系在了一起。

source: "You sound like my dad."
zh_cn: “你听起来就像我老爸。”

source: "Sorry," she said.
zh_cn: “对不起，”她说道。

source: She knew the story.
zh_cn: 她知道这个故事。

source: My father had told me, one morning before school six years earlier, that he and my mother had outgrown each other- which was half true.
zh_cn: 在6年前的一个早晨，我正要去上学，我爸告诉我，他和我妈已经变得不适合彼此了。——这话只有一半是对的。

source: "And I like fixing cars."
zh_cn: “我喜欢摆弄汽车。”

source: "Maybe you'll find something you like better.
zh_cn: “也许你会发现有更喜欢做的事情。

source: Something friendlier to your back and knuckles."
zh_cn: 一些对你的腰背和关节更有益的事情。”

source: "Nick told me you used to work on cars."
zh_cn: “尼克告诉我说，你以前也曾经跟车打过交道。”

source: She caught her lip in her teeth, and her mind seemed to change gears.
zh_cn: 她用牙齿咬住了嘴唇，她的思绪似乎换了档。

source: "Do you like fortune cookies?
zh_cn: “你喜欢幸运签语饼吗？【中餐馆里送给顾客的小点心，每个里面都有一条签语。——译者注】

source: I had one the other night that said, 'Spend much money on many doors.'"
zh_cn: 有天晚上我拿到一个，上面说：'要舍得花钱尝试各种出路。'”

source: I thought about that, and shook my head.
zh_cn: 我想了想这句话，然后摇摇头。

source: With a Chinese accent she said, "It mean go to correge.
zh_cn: 她模仿着华人口音说到：“这意味着去念熟（书）。

source: Open possibirities."
zh_cn: 打开新的集（机）会。”

source: I spent the next moment in love with her, a feeling that both hurt and exhilarated me.
zh_cn: 听她说完，我心头涌起一阵爱意。那种感觉既令我痛苦又让我兴奋。

source: She had a young, freckled complexion, and I was already losing hair in front, my teeth stained from cigarettes and coffee.
zh_cn: 她的皮肤有些雀斑，显得还很年轻。而我的前额已经有些谢顶，我的牙齿也被香烟和咖啡染黄。

source: I imagined the years between us were offset.
zh_cn: 我想像在我们之间，年纪上的差别已经被抵销了。

source: I imagined- all I could do was imagine- that if anyone saw us holding hands on the street, they would think we were the same age.
zh_cn: 我想象——我所能做的只有想象——如果有人看到我们在街上牵手而行，他们会认为我们俩年龄相当。

source: "Tommy Costello was human once," she warned.
zh_cn: “汤米·科斯特洛以前也曾经是个正常人，”她警告说。

source: "Don't turn into him."
zh_cn: “你可别变成他现在那样。”

source: "I was actually thinking of Nick.
zh_cn: “我实际上脑子里想的是尼克。

source: All his rechecks."
zh_cn: 还有他现在的那些返修。”

source: She lit a cigarette for herself.
zh_cn: 她给自己点了支烟。

source: "Justin, what do you think karma is?"
zh_cn: “贾斯汀，你觉得什么是恶报呢？”

source: "Why bad things happen to good people," I said.
zh_cn: “就是坏事发生在好人身上，”我说。

source: And I thought, too late, of the baby boy they'd lost not even two years ago.
zh_cn: 话已出口，我才想起不到两年前他俩曾经夭折掉的儿子。可是为时已晚。

source: If I'd offended her, she didn't show it.
zh_cn: 不过就算我惹恼了她的话，她也并没有表现出来。

source: She brushed her permed, always-damp-looking red hair behind an ear and shaped the ash of her cigarette.
zh_cn: 她把她那看上去永远湿润的红色卷发拢到耳朵后面，弹掉她的烟灰。

source: "I don't think Tommy can blame karma," she said.
zh_cn: “我觉得汤米不能埋怨恶报，”她说。

source: "Out of the Hole isn't a shop, it's a circus.
zh_cn: “‘领先汽修’不像是个店，而是个马戏团。

source: You guys aren't even nice to your customers."
zh_cn: 你们对顾客根本都没有好气儿。”

source: This was often true- we modified engines for gearheads who tipped well and would've forgiven us for crapping on the floor if we juiced a dozen more ponies out of their V-8s.
zh_cn: 通常确实是这样。我们给那些满脑子机械指标的家伙改装发动机。只要我们能让他们的八缸发动机提高十几马力的输出，他们就会很慷慨地给我们小费，并且不追究我们把车厢地板弄脏这种事。

source: Tommy was worse than anyone.
zh_cn: 汤米尤其糟糕。

source: Mary Ann had to buy a separate coffeemaker for the bays just to keep him out of the lobby, where he got fingerprints everywhere, and swore and farted as he pleased.
zh_cn: 玛丽安不得不另买了一个咖啡机放在修理区，就是为了不让他到营业室里去掺和。只要他一进去，就会把脏手印留得到处都是，而且满嘴脏话，随意放屁。

source: "It's the path of least resistance," she said.
zh_cn: “他挑了条轻松的路走，”她说。

source: "He has no decency, no discipline.
zh_cn: “他不讲体面，也没有规矩。

source: And so his work is starting to suffer.
zh_cn: 所以他的工作才会受到影响。

source: Where's the mystery?"
zh_cn: 这有什么神秘？”

source: THE FIRST OF two mistakes I made with Mary Ann happened during sex.
zh_cn: 我对玛丽安一共干过两件错事。第一件是在做爱时干的。

source: I was starting to worry that she'd think missionary was the only position I knew, so I asked if we could try doggy style.
zh_cn: 当时我变得有点担心她认为我只会传教士姿势，所以我问她能不能试试从后面做。

source: She looked away and freed herself from me, turned over and waited, slumped over the sofa arm.
zh_cn: 她把目光转向别处，和我分开身，转身趴在沙发扶手上等着我。

source: I apologized and turned her back, holding her fiercely, and, as if I'd just pulled her from a hole in the ice, felt her life return.
zh_cn: 我向她说了声对不起，并把她翻了过来，紧紧地抱住她。我能感觉到她的活力又重新回来了，就好像我刚刚把她从冰窟窿里拉出来一样。

source: The second mistake was going into their bedroom.
zh_cn: 第二个错误是我进了他们的卧室。

source: The door stayed closed when I was over, and one morning while she was in the bathroom I saw my chance.
zh_cn: 每次我去他们家，卧室的门都关着。有一天早晨，她进了洗手间。我的机会来了。
